{
  "basics": {
    "name": "Yohana Kefella",
    "label": "Bioinformatics Analyst",
    "picture": "/images/Yohana_headshot.jpg",
    "email": "yohanakefella@gmail.com",
    "phone": "617-447-0419",
    "website": "https://yohana.github.io",
    "summary": "Hi! I'm a Bioinformatics Analyst at Boston University Chobanian & Avedisian School of Medicine. I support research on molecular alterations underlying bronchial premalignant lesions, precursors to lung squamous cell carcinoma. My responsibilities include:\n\n- Maintaining and enhancing RNA-seq pipelines (WDL/Terra) for NIH Human Tumor Atlas data\n- Performing preprocessing, quality control, and metadata curation for multi-omic datasets\n- Managing and uploading data for the Lung Pre-Cancer Atlas Data Portal to meet data-sharing requirements\n- Conducting bulk and single-cell RNA-seq analyses for lung precancer and chemoprevention studies\n- Collaborating with trainees and faculty to analyze multi-omic data\n- Contributing figures, methods, and text for manuscripts and grant proposals",
    "location": {
      "address": "",
      "postalCode": "02119",
      "city": "Boston",
      "countryCode": "USA",
      "region": "Massachusetts"
    },
    "profiles": [
      {
        "network": "github",
        "username": "ykefella",
        "url": "https://github.com/ykefella"
      },
      {
        "network": "linkedin",
        "username": "ykefella",
        "url": "https://www.linkedin.com/in/ykefella"
      },
      {
        "network": "instagram",
        "username": "thebluenerve",
        "url": "http://instagram.com/thebluenerve"
      }
    ]
  },
  "interests": [
    {
      "name": "Single Cell Genomics",
      "keywords": [
      ]
    },
    {
      "name": "Machine Learning",
      "keywords": [
      ]
    },
    {
      "name": "Bioinformatics pipeline",
      "keywords": [
      ]
    }
  ],
  "skills": [
    {
      "name": "Programming/Development",
      "level": "",
      "keywords": [
        "Python", "R", "Shell Scripting", "Nextflow", "WDL", "Snakemake", "Git", "AWS"
      ]
    },
    
  ],
  "education": [
    {
      "institution": "Northeastern University, Boston, MA",
      "area": "Bioinformatics",
      "studyType": "M.S.",
      "startDate": "September 2019",
      "endDate": "December 2021",
      "gpa": "3.875",
      "courses": [
        "Computational Methods – 1 and 2, Bioinformatics Programming, Machine Learning, Data Analytics"
      ]
    },
  ],
  "work": [
    {
      "company": "Computational Biomedicine",
      "position": "Bioinformatics Analyst",
      "startDate": "July 2022",
      "endDate": "Present",
      "summary": "Boston University Chobanian & Avedisian School of Medicine, Boston MA",
      "highlights": [
        "Maintain, update, and enhance a RNA-Seq pipeline (written in WDL) developed to process NIH Human Tumor Atlas Network Data using the Terra cloud platform",
        "Possess extensive experience in designing, developing, and optimizing workfolw descriptive language (WDL)  for high-throughput analysis workflows",
        "Conduct multi-omic data preprocessing, quality control, and metadata curation ",
        "Support data management and data upload for the Lung Pre-Cancer Atlas Data Portal to comply with data sharing mandates",
        "Perform data analyses on bulk and single-cell RNA-seq data to scientifically advance Lung Pre-Cancer Atlas and lung chemoprevention projects",
        "Collaborate with PhD trainees, post-doctoral fellows, and faculty to process and analyze multi-omic data",
        "Contribute methods, results, figures, and text to scientific manuscripts, white papers, and grant applications"

      ]
    },
    {
      "company": "Systems Biology Group, Merck Co & Inc., Exploratory Science Center ",
      "position": "Bioinformatics Co-op/Intern",
      "website": "",
      "startDate": "July 2021",
      "endDate": "December 2021",
      "summary": "Cambridge, MA",
      "highlights": [
        "Implemented supervised machine learning pipelines for omics data",
        "Utilized Snakemake and Nexflow to establish reproducible ML pipelines",
        "Utilized predictive modeling for mechanistic hypothesis generation and biomarker discovery in the microbiome field",
        "Presented results at collaborative meetings with internal research groups"
      ]
      
    }
    ,
    {
      "company": "Spectrus LLC",
      "position": "Data Science Internship",
      "website": "",
      "startDate": "June 2020",
      "endDate": "August 2020",
      "summary": "Beverly, MA",
      "highlights": [
        "Engaged with scientists to understand their data analysis challenges and develop ideas on how to manage their workflow",
        "Worked on implementing a Mass Spectrometry Data Analysis Pipeline",
        "Created interactive Rshiny applications to automate generation of SLD template, sample ID, load and retrieve Mass Spectrometry data from SQL database "
      ]
    },
    
  ],
  "Project experience": [
    {
      "organization": "Section of Computational Biomedicine",
      "website": "",
      "position": "Impact of oral supplementation of sulforaphane for 12 months on lung cancer-related gene expression in former smokers at high risk for lung cancer: Results from a randomized placebo-controlled phase II clinical trial",
      "startDate": "November 2022",
      "endDate": "Present",
      "summary": "",
      "highlights": [
        "The overall goal was to examine whether oral intake of sulforaphane for 12 months impacts the gene expression of previously identified lung cancer- and premalignant lesion-related gene signatures in bronchial and nasal brushing samples",
        "Pre-processed and conducted quality control on bulk RNA-seq data from bronchial and nasal brushings using an RNA-seq cloud-based pipeline",
        "Curated previously published NRF2, smoking, and lung cancer-associated gene signatures and identified signatures perturbed by sulforaphane treatment.  Identified similarities and differences between the nasal and bronchial brush gene signature scores associated with treatment using linear mixed effect models. Sulforaphane treatment over 12 months impacted lung cancer-associated expression in nasal but not in bronchial tissue from former smokers",
        "Identified genes up- and down-regulated with treatment that were similar and different between nasal and bronchial brushes using linear mixed effect models.  The biology and cell type specificity of these genes was examined to identify potential sulforaphane effects on the epithelium",
      ]
    },
    {
      "organization": "Northeastern University",
      "website": "",
      "position": "Single-cell landscape of lung squamous cell premalignancy in the NTCU induced mice model",
      "startDate": "November 2023",
      "endDate": "Present",
      "summary": "",
      "highlights": [
      "The overall goal is to understand the molecular and cellular alterations via scRNA-seq associated with lung squamous premalignant lesion development and progression in the N-nitroso-tris-chloroethylurea (NTCU) mouse model.   Sensitive (A/j) and resistant (C57BL/6J) strains of mice to NTCU were utilized to allow for characterization of alterations associated with repair versus lesion progression",
      "Pre-processed and conducted quality control on the scRNA-seq data, performed clustering using different subsets of cell and different clustering methods, performed differential compositional analysis to identify cell states changes associated with strain, age, and lesion severity, identified copy number alterations in epithelial cells, and phenotyped cell clusters based on other mouse and human lung scRNA-seq datasets",
      "Results suggest the expansion of a Keratin 5+ basal population in carcinogen-treated A/J mice with severe lesions that harbors copy number and gene expression alterations that may promote tumorigenesis. A subset of these alterations are shared with human lung squamous cell carcinoma, supporting the utility of the NTCU mouse model as a preclinical tool for understanding the mechanism that drive LUSC tumorigenesis",
      ]
    }
  ],

  "manuscripts": [
    {
      "organization": "NIH",
      "website": "",
      "position": "Epithelial miR-149-5p up-regulation is associated with immune evasion in progressive bronchial premalignant lesions",
      "startDate": "February 2025",
      "endDate": "",
      "summary": "",
    },
    {
      "organization": "NIH",
      "website": "",
      "position": "Placental transcriptome analysis in opioid-exposed versus non-opioid exposed pregnancies",
      "startDate": "March 2025",
      "endDate": "",
      "summary": "",
    },
    {
      "organization": "NIH",
      "website": "",
      "position": "Attention-based deep learning for analysis of pathology images and gene expression data in lung squamous premalignant lesions",
      "startDate": "June 2025",
      "endDate": "",
      "summary": "",
    },
  ],
  "references": [
    {
      "name": "Available upon request",
      "reference": ""
    }
  ]
}
